**Дисциплина:** _Программирование. Язык СИ_

 **Преподаватели:** _Власов Дмитрий Викторович, Мельников Федор Владиславович_
 
 **Учебное заведение:** _РГПУ им. А. И. Герцена_

 # Самостоятельная работа 1
 
## Работа с указателями, структурами и динамической памятью

 **Автор:** Иванова А.Д., группа ИВТ-1.2 
 
 ---
 
 ## Задание 1. Динамический массив и вычисление среднего арифметического

 ### Постановка задача:
 
Напишите программу на языке Си, которая:

 • Запрашивает у пользователя количество элементов массива (целое число N).
 
 • Динамически выделяет память для массива из N элементов типа float.
 
 • Заполняет массив значениями, введёнными с клавиатуры.
 
 • Вычисляет и выводит среднее арифметическое всех элементов массива.
 
 • Приобращении к элементам массива используйте арифметику указателей (без оператора []).
 
 • Освобождает выделенную память в конце работы программы.

 ### Список идентификаторов:
| Идентификатор | Тип          |Смысл|
|---------------|--------------|------------|
|n           | int        | Размер массива |
| arr         | float *   | Указатель на динамические массив |
| curr     | float *   | Указатель для обхода массива |
| sum  | float     | Сумма элементов массива|
| avg | float     | Среднее арифметичекое |

 ### Код программы:

```c
#include <stdio.h>
#include <stdlib.h>

int main(void) {
    int n;
    printf("введите количество элементов массива: ");
    scanf("%d", &n);

    if (n <= 0) {
        printf("ошибка: Количество элементов должно быть положительным.\n");
        return 1;
    }

    //Динамическое выделение памяти для массива float
    float *arr = (float *)malloc(n * sizeof(float));
    if (arr == NULL) {
        printf("ошибка: не удалось выделить память.\n");
        return 1;
    }

    //Заполнение массива значениями с клавиатуры
    float *curr = arr; //Используем указатель для обхода массива
    for (int i = 0; i < n; i++) {
        printf("элемент %d: ", i + 1);
        scanf("%f", curr++); 
    }

    //Вычисление среднего арифметического
    float sum = 0.0;
    curr = arr; // Сбрасываем указатель обратно в начало массива
    for (int i = 0; i < n; i++) {
        sum += *curr++;  
    }
    float avg = sum / n;
    printf("среднее арифметическое элементов массива: %.2f\n", avg);

    //Освобождение выделенной памяти
    free(arr);

    return 0;
}
```

### Результат выполненной работы:



---

 ## Задание 2. Каталог книг

 ### Постановка задача:
 
 Напишите программу, которая:
 
 • Создаёт массив из 3-х экземпляров структуры Book.
 
 • Запрашивает у пользователя данные для каждой книги (название, автора и год издания).
 
 • Выводит информацию обо всех книгах на экран, используя для этого отдельную функцию printBook(), которая
 принимает указатель на структуру Book.

 ### Список идентификаторов:
| Идентификатор | Тип          |Смысл|
|---------------|--------------|------------|
|i          | int        | Переменная цикла для обработки массива книг |
|Book       | int        | Структура для хранения данных о книге |
| title         | char  | Поле для хранения названия книги |
| author    | char   | Поле для хранения автора книги|
| year | int | Поле для хранения года издания книги|

 ### Код программы:

```c
#include <stdio.h>
#include <string.h>

struct Book {
    char title[50];  
    char author[50]; 
    int year;         
};

// Функция для вывода информации о книге
void printBook(struct Book *book) {
    printf("название: %s\n", book->title);
    printf("автор: %s\n", book->author);
    printf("год издания: %d\n", book->year);
    
}

int main(void) {
    struct Book books[3]; 

    for (int i = 0; i < 3; i++) {
        printf("введите данные для книги #%d:\n", i + 1);
        
        printf("название: ");
        fgets(books[i].title, sizeof(books[i].title), stdin);
        books[i].title[strcspn(books[i].title, "\n")] = '\0'; 

        printf("автор: ");
        fgets(books[i].author, sizeof(books[i].author), stdin);
        books[i].author[strcspn(books[i].author, "\n")] = '\0';

        printf("год издания: ");
        scanf("%d", &books[i].year);
        getchar(); // Очищаем буфер ввода после scanf
    }
    
    printf("\nинформация о книгах:\n");
    for (int i = 0; i < 3; i++) {
        printBook(&books[i]);
    }

    return 0;
}
```

### Результат выполненной работы:



---

 ## Задание 3. Определение сезона по номеру месяца

 ### Постановка задача:
 
  Напишите программу, которая:
  
 • Запрашивает у пользователя номер месяца (целое число от 1 до 12).
 
 • На основе введённого номера месяца определяет и выводит соответствующий сезон: Зима: декабрь (12), январь (1) и февраль (2); Весна: март (3), апрель (4) и май (5); Лето: июнь (6), июль (7) и август (8); Осень: сентябрь (9), октябрь (10) и ноябрь (11).
 
 • Для определения сезона можно использовать условные операторы (if-else) или конструкцию switch.

 ### Список идентификаторов:
| Идентификатор | Тип          |Смысл|
|---------------|--------------|------------|
| month        | int   | Номер месяца, введенный с клавиатуры |
| season    | enum Season   | Хранит текущий сезон |
| enum Season | int   | Обозначает сезоны года |
| season names | char*  | Массив строк |


 ### Код программы:

```c
#include <stdio.h>

enum Season {
    WINTER,
    SPRING,
    SUMMER,
    AUTUMN
};

int main(void) {
    int month;
    enum Season season;
    
    const char *season_names[] = {"Зима", "Весна", "Лето", "Осень"};

    printf("введите номер месяца (от 1 до 12): ");
    scanf("%d", &month);

    if (month < 1 || month > 12) {
        printf("ошибка: номер месяца должен быть от 1 до 12.\n");
        return 1;
    }

    switch (month) {
        case 12:
        case 1:
        case 2:
            season = WINTER;
            break;
        case 3:
        case 4:
        case 5:
            season = SPRING;
            break;
        case 6:
        case 7:
        case 8:
            season = SUMMER;
            break;
        case 9:
        case 10:
        case 11:
            season = AUTUMN;
            break;
        default:
            season = WINTER; 
            break;
    }

    printf("сезон: %s\n", season_names[season]);
    
    return 0;
}
```
### Результат выполненной работы:


---
